&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	НомерПервойСтроки = 2; //в первой строке шапка таблицы
	НомерПервойКолонки = 1;
	КоличествоСтрокВЭксель = 0;
	КоличествоКолонокВЭксель = 0;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Фильтр = "Файл Excel (*.xlsx)|*.xlsx|Файл Excel (*.xls)|*.xls";
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Заголовок = "Выберите файл Excel";
	
	Если ДиалогВыбора.Выбрать() Тогда
		
		ИмяФайлаЭксель = ДиалогВыбора.ПолноеИмяФайла;
		
		Попытка
			Эксель = Новый COMОбъект("Excel.Application");
			Эксель.WorkBooks.Open(ИмяФайлаЭксель);
			Состояние("Обработка файла Microsoft Excel...");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при открытии файла с помощью Excel.");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Попытка 
			Эксель.Sheets(1).Select();    
		Исключение
			Эксель.ActiveWorkbook.Close();  
			Эксель = 0;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл "+Строка(Объект.ИмяФайла)+" не соответствует необходимому формату! Первый лист не найден!");
			Возврат;
		КонецПопытки;
		
    	КоличествоСтрокВЭксель = Эксель.Cells.SpecialCells(11).Row;
		КоличествоКолонокВЭксель = Эксель.Cells.SpecialCells(11).Column;
		
		Область = Эксель.Range(Эксель.Cells(НомерПервойСтроки,НомерПервойКолонки), Эксель.Cells(КоличествоСтрокВЭксель,КоличествоКолонокВЭксель));
		Данные = Область.Value.Выгрузить();		
		
		Попытка
			Эксель.DisplayAlerts = 0;
			Эксель.ActiveWorkbook.Close();
			Эксель.DisplayAlerts = 1;
			Эксель.Quit(); 
			Эксель = Неопределено;        
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отключиться от Excel - " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		ОбработатьДанныеИзЭксельНаСервере(Данные)
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеИзЭксельНаСервере(Данные)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ИмяКолонки1");
	ТаблицаДанных.Колонки.Добавить("ИмяКолонки2");
	ТаблицаДанных.Колонки.Добавить("ИмяКолонки3");
	
	Для Индекс = 1 По Данные[0].Количество()-1 Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Номенклатура = СокрЛП(Данные[0][Индекс-1]); 
		НоваяСтрока.Код = СокрЛП(Данные[1][Индекс-1]);          
		НоваяСтрока.ДирективнаяЦенаСНДС = СокрЛП()Данные[2][Индекс-1]); 
		
	КонецЦикла;
	
	ТаблицаДанных = Неопределено;
			
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена"); 
	
КонецПроцедуры