// Инициация многопоточного выполнения кода
 Процедура ЗапуститьВыполнениеОбработкиДанных()

    //число параллельных потоков
	ПараллельныхПотоков = 5;

	//время начала выполнения обработки
	ВремяНачала = ТекущаяДата();

    МассивЗаданий = Новый Массив;

	Запрос = Новый Запрос;
    Запрос.Текст = "";//текст запроса для выборки всех данных для обработки
    ТаблицаДанных = Запрос.Выполнить().Выгрузить();

    Для каждого Стр из ТаблицаДанных Цикл

        МассивПараметров = Новый Массив; //параметры для передачи фоновому заданию
        МассивПараметров.Добавить(Параметр1);
        МассивПараметров.Добавить(Параметр2);
		
		//создание задания путем вызова процедуры ОбработатьДанныеПоАлгоритму в серверном общем модуле ОбработкаДанныхНаСервере
        Задание = ФоновыеЗадания.Выполнить("ОбработкаДанныхНаСервере.ОбработатьДанныеПоАлгоритму", МассивПараметров);
        МассивЗаданий.Добавить(Задание);

        Если МассивЗаданий.Количество() >= ПараллельныхПотоков Тогда
            Попытка
                ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий);
            Исключение
            КонецПопытки;
            МассивЗаданий.Очистить();
        КонецЕсли;

    КонецЦикла;

    Если МассивЗаданий.Количество() > 0 Тогда
        Попытка
            ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий);
        Исключение
        КонецПопытки;
        МассивЗаданий.Очистить();
    КонецЕсли;

    Сообщить("Время выполнения: " + (ТекущаяДата() - ВремяНачала) + " секунд");

КонецПроцедуры

//Процедура общего модуля ОбработкаДанныхНаСервере выполняющая алгоритм обработки данных в фоновом задании 
Процедура ОбработатьДанныеПоАлгоритму(Параметр1, Параметр2) Экспорт

	//запрос для выборки порции данных (с учетом отборов заданных параметрами) для обработки в данном потоке
	Запрос = Новый Запрос;
	Запрос.Текст = "";
    Запрос.УстановитьПараметр("Параметр1", Параметр1);
    Запрос.УстановитьПараметр("Параметр2", Параметр2);
    ТаблицаДанных = Запрос.Выполнить().Выгрузить();

    Для каждого Стр из ТаблицаДанных Цикл
        //Обработка данных
    КонецЦикла;

КонецПроцедуры