// Выбор загружаемого файла, заполнение реквизита формы "АдресФайлаВоВременномХранилище"
//
// Возвращаемое значение:
//  Булево - Истина при успешном выборе файла
//
&НаКлиенте
Функция ВыполненУспешныйВыборФайла()
    
    АдресФайлаВоВременномХранилище = "";
    
    #Если ВебКлиент Тогда
		
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект);
        НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
                
    #Иначе
        
        ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
        
        ДиалогВыбораФайла.Фильтр = "Таблица(*.xlsx)|*.xlsx";
        ДиалогВыбораФайла.Заголовок = "Выберите файл";
        ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
        ДиалогВыбораФайла.Расширение = "xlsx";
        ДиалогВыбораФайла.МножественныйВыбор = Ложь;
        
        Если ДиалогВыбораФайла.Выбрать() Тогда
            ФайлЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
        Иначе
            Возврат Ложь;
        КонецЕсли;
        
        АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла));
        
    #КонецЕсли
    
    Возврат НЕ ПустаяСтрока(АдресФайлаВоВременномХранилище); 
    
КонецФункции

&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) экспорт

	Если НЕ Результат тогда
		НачатьУстановкуРасширенияРаботыСФайлами();
	КонецЕсли;
	
	НачатьПомещениеФайлаНаСервер(,,,АдресФайлаВоВременномХранилище);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
    
    Если ВыполненУспешныйВыборФайла() Тогда
        ВыполнитьЗагрузкуФайлаНаСервере(); 
    КонецЕсли; 
    
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуФайлаНаСервере()
    
    АдресВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
    
    // Запись двоичных данных из вр. хранилища:
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);

    Если ЗаписьФайлаПроизошлаУспешно(ДвоичныеДанные, АдресВременногоФайла) Тогда
		//обработка данных
    Иначе
        ЗаписьЖурналаРегистрации("Ошибка загрузки файла на сервере",
							УровеньЖурналаРегистрации.Ошибка,,,
							"Загрузка прервана на сервере. Файл "+ АдресВременногоФайла +" не обнаружен...");
    КонецЕсли;     
    
КонецПроцедуры

// Попытка записи данных в файл с таймаутом на время записи
//
// Параметры:
//  Источник - Произвольный объект 1С, поддерживающий запись в файл через метод "Записать" - например ДвоичныеДанные или ТекстовыйДокумент
//  АдресФайла - Строка
//  ОграничениеВремениЗаписи - Число, количество секунд в течение которого будет выполнятся проверка существования файла
//  КомандаЗаписи - Строка, для различных случаев сохранения файла, в алгоритме будет параметром метода "Выполнить"
//
// Возвращаемое значение: 
//  Булево
//
// Пример использования:
//	ЗаписьФайлаПроизошлаУспешно(ДвочныеДанные, ИмяВременногоФайла, 5, "Источник.Записать(АдресФайла, КодировкаТекста.UTF8);")
//
&НаСервере
Функция ЗаписьФайлаПроизошлаУспешно(Источник, АдресФайла, ОграничениеВремениЗаписи = 15, КомандаЗаписи = "")
    
    Попытка 
        
        Если ПустаяСтрока(КомандаЗаписи) Тогда
            Источник.Записать(АдресФайла);                
        Иначе
            Выполнить(КомандаЗаписи);
        КонецЕсли; 
        
        ТекДата = ТекущаяДата();
        ПредСекунда = 0;
        Пока Истина Цикл
            
            КолСекунд = ТекущаяДата() - ТекДата;
            ТекСекунда = КолСекунд;
            
            Если ПредСекунда < ТекСекунда Тогда
                // Раз в секунду - проверка существования записываемого файла
                ЗаписываемыйФайл = Новый Файл(АдресФайла);
                Если ЗаписываемыйФайл.Существует() Тогда
                    Возврат Истина;
                КонецЕсли; 
                
                ПредСекунда = ТекСекунда;
            КонецЕсли; 
            
            Если КолСекунд > ОграничениеВремениЗаписи Тогда
                ВызватьИсключение "Время записи файла превысило "+ ОграничениеВремениЗаписи +" секунд.";
			КонецЕсли; 
			
        КонецЦикла; 
        
    Исключение
        ЗаписьЖурналаРегистрации("Ошибка записи файла на сервере",
							УровеньЖурналаРегистрации.Ошибка,,,
							"Не удалось записать файл на сервере - " + ОписаниеОшибки()); 
        Возврат Ложь;
    КонецПопытки;    
    
КонецФункции